cluster-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test plan Staging Percona cluster" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="staging-connections" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1439499658000</longProp>
        <longProp name="ThreadGroup.end_time">1439499658000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="dbs-staging config" enabled="false">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">mypool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://agave-dbs-staging.tacc.utexas.edu:3301/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">10</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="only active jobs" enabled="false">
          <stringProp name="dataSource">mypool</stringProp>
          <stringProp name="query">select `last_updated`, `tenant_id`, `name`, `status`, `queue_request`, `software_name`, `uuid` from `jobs` where `execution_system` = &apos;stampede.tacc.utexas.edu&apos; and `owner` = &apos;vaughn&apos; and `status` in (&apos;CLEANING_UP&apos;, &apos;ARCHIVING&apos;, &apos;RUNNING&apos;, &apos;PAUSED&apos;, &apos;QUEUED&apos;, &apos;PENDING&apos;, &apos;STAGING_INPUTS&apos;, &apos;STAGING_JOB&apos;, &apos;SUBMITTING&apos;, &apos;PROCESSING_INPUTS&apos;, &apos;STAGED&apos;) order by `last_updated` ASC;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list apps" enabled="false">
          <stringProp name="dataSource">mypool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from softwares;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list systems" enabled="false">
          <stringProp name="dataSource">mypool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from systems;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="candidate-prod-connections" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1439499658000</longProp>
        <longProp name="ThreadGroup.end_time">1439499658000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="dbs-maxscale-core-prod-candidate config" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">prodpool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://iplant-ssh.tacc.utexas.edu:3302/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">20</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Simple Controller" enabled="true"/>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="only active jobs" enabled="false">
            <stringProp name="dataSource">mypool</stringProp>
            <stringProp name="query">select `last_updated`, `tenant_id`, `name`, `status`, `queue_request`, `software_name`, `uuid` from `jobs` where `execution_system` = &apos;stampede.tacc.utexas.edu&apos; and `owner` = &apos;vaughn&apos; and `status` in (&apos;CLEANING_UP&apos;, &apos;ARCHIVING&apos;, &apos;RUNNING&apos;, &apos;PAUSED&apos;, &apos;QUEUED&apos;, &apos;PENDING&apos;, &apos;STAGING_INPUTS&apos;, &apos;STAGING_JOB&apos;, &apos;SUBMITTING&apos;, &apos;PROCESSING_INPUTS&apos;, &apos;STAGED&apos;) order by `last_updated` ASC;</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list apps" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from softwares;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list systems" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from systems; 	</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="systemid-next" enabled="false">
              <stringProp name="CounterConfig.start">1</stringProp>
              <stringProp name="CounterConfig.end">1000</stringProp>
              <stringProp name="CounterConfig.incr">1</stringProp>
              <stringProp name="CounterConfig.name">systemid</stringProp>
              <boolProp name="CounterConfig.per_user">false</boolProp>
            </CounterConfig>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list jobs" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from jobs;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list monitors" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from monitors;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list notifications" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from notifications;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list postits" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from postits;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
        </hashTree>
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="false">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">9</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>10.0</value>
            <savedValue>0.0</savedValue>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="insert-system" enabled="false">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Update Statement</stringProp>
            <stringProp name="query">INSERT INTO `agave-api`.`systems` (`id`, `available`, `created`, `description`, `global_default`, `last_updated`, `name`, `owner`, `publicly_available`, `revision`, `site`, `status`, `system_id`, `tenant_id`, `type`, `uuid`, `storage_config`)
VALUES
	(${newid}, 00000001, &apos;2013-11-12 06:49:58&apos;, &apos; The Data Store technologies.&apos;, 00000001, &apos;2013-11-12 07:08:30&apos;, &apos;iPlant Data Store&apos;, &apos;testuser&apos;, 00000001, 4, &apos;iplantcollaborative.org&apos;, &apos;UP&apos;, &apos;data.iplantcollaborative.org.${newid}&apos;, &apos;iplantc.org&apos;, &apos;STORAGE&apos;, &apos;0001384260598633-5056a550b8-0001-006-${newid}&apos;, 1);
</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="system-incrementor" enabled="true">
              <stringProp name="CounterConfig.start">3000</stringProp>
              <stringProp name="CounterConfig.incr">1</stringProp>
              <stringProp name="CounterConfig.name">newid</stringProp>
              <boolProp name="CounterConfig.per_user">false</boolProp>
            </CounterConfig>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="candidate-prod-validation" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <longProp name="ThreadGroup.start_time">1439499658000</longProp>
        <longProp name="ThreadGroup.end_time">1439499658000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="dbs-maxscale-core-prod-candidate config" enabled="false">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">maxscalepool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://iplant-ssh.tacc.utexas.edu:3302/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">1</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="percona-core1-prod-candidate config" enabled="false">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">core1pool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://agave-percona-core-1.tacc.utexas.edu:3306/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">1</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="percona-core2-prod-candidate config" enabled="false">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">core2pool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://agave-percona-core-2.tacc.utexas.edu:3306/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">1</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="percona-core3-prod-candidate config" enabled="false">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">core3pool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://129.114.7.100:3306/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">1</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list systems" enabled="false">
          <stringProp name="dataSource">maxscalepool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from systems;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list core1 systems" enabled="false">
          <stringProp name="dataSource">core1pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list core2 systems" enabled="false">
          <stringProp name="dataSource">core2pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list core3 systems" enabled="false">
          <stringProp name="dataSource">core3pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="count core1 systems" enabled="false">
          <stringProp name="dataSource">core1pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select count(*) from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="count core2 systems" enabled="false">
          <stringProp name="dataSource">core2pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select count(*) from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="count core3 systems" enabled="false">
          <stringProp name="dataSource">core3pool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select count(*) from systems where id &gt; 3000;		</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="insert-system" enabled="false">
          <stringProp name="dataSource">prodpool</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">INSERT INTO `agave-api`.`systems` (`id`, `available`, `created`, `description`, `global_default`, `last_updated`, `name`, `owner`, `publicly_available`, `revision`, `site`, `status`, `system_id`, `tenant_id`, `type`, `uuid`, `storage_config`)
VALUES
	(${next}, 00000001, &apos;2013-11-12 06:49:58&apos;, &apos; The Data Store technologies.&apos;, 00000001, &apos;2013-11-12 07:08:30&apos;, &apos;iPlant Data Store&apos;, &apos;testuser&apos;, 00000001, 4, &apos;iplantcollaborative.org&apos;, &apos;UP&apos;, &apos;data.iplantcollaborative.org.${next}&apos;, &apos;iplantc.org&apos;, &apos;STORAGE&apos;, &apos;0001384260598633-5056a550b8-0001-006-${next}&apos;, 1);

</stringProp>
          <stringProp name="variableNames">next</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="system-incrementor" enabled="true">
            <stringProp name="CounterConfig.start">3000</stringProp>
            <stringProp name="CounterConfig.end">10</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">next</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
          </CounterConfig>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>